### Eksik veriler

In [9]:
import numpy as np
import pandas as pd

* ### Eksik veriler

In [10]:
sozluk= { "Bayburt ": [39,29,np.nan],"Erzrum": [25,np.nan,69] ,"trabzon": [10,20,30]}
havaDurumu =pd.DataFrame(sozluk)
havaDurumu

   Bayburt   Erzrum  trabzon
0      39.0    25.0       10
1      29.0     NaN       20
2       NaN    69.0       30

In [11]:
havaDurumu.dropna()

   Bayburt   Erzrum  trabzon
0      39.0    25.0       10

In [12]:
havaDurumu.dropna(axis=1)

   trabzon
0       10
1       20
2       30

In [16]:
sozluk1= { "Bayburt ": [39,29,np.nan],"Erzrum": [25,np.nan,69] ,"trabzon": [10,20,30]}
sozluk1
# sozluk1.fillna(20)

{'Bayburt ': [39, 29, nan], 'Erzrum': [25, nan, 69], 'trabzon': [10, 20, 30]}

### Gruplandırma
* Group By

In [21]:
maasSozluk = {
             "departmanlar" : ["yazılım","yazılım","hukuk","hukuk","pazarlama","pazarlama"],
              "isim":["ahmet","mehhmet","atil","osman","temel","fatma"],
              "maas":[1000,2000,3000,4000,5000,6000]
              }
maasSozluk =pd.DataFrame(maasSozluk)
maasSozluk

  departmanlar     isim  maas
0      yazılım    ahmet  1000
1      yazılım  mehhmet  2000
2        hukuk     atil  3000
3        hukuk    osman  4000
4    pazarlama    temel  5000
5    pazarlama    fatma  6000

In [31]:
groupObje=maasSozluk.groupby("departmanlar")
groupObje.count()

              isim  maas
departmanlar
hukuk            2     2
pazarlama        2     2
yazılım          2     2

In [35]:
groupObje.mean("maas")
groupObje.min()

               isim  maas
departmanlar
hukuk          atil  3000
pazarlama     fatma  5000
yazılım       ahmet  1000

In [36]:
groupObje.describe()

              maas
             count    mean         std     min     25%     50%     75%     max
departmanlar
hukuk          2.0  3500.0  707.106781  3000.0  3250.0  3500.0  3750.0  4000.0
pazarlama      2.0  5500.0  707.106781  5000.0  5250.0  5500.0  5750.0  6000.0
yazılım        2.0  1500.0  707.106781  1000.0  1250.0  1500.0  1750.0  2000.0